
## Task 1.1
numbers = [
"אחת", "שתיים", "שלוש", "ארבע", "חמש", "שש", "שבע", "שמונה", "תשע", "עשר",
"אחת-עשרה", "שתים-עשרה", "שלוש-עשרה", "ארבע-עשרה", "חמש-עשרה", "שש-עשרה", "שבע-עשרה", "שמונה-עשרה", "תשע-עשרה", "עשרים",
"עשרים-ואחת", "עשרים-ושתיים", "עשרים-ושלוש", "עשרים-וארבע", "עשרים-וחמש", "עשרים-ושש", "עשרים-ושבע", "עשרים-ושמונה", "עשרים-ותשע", "שלושים",
"שלושים-ואחת", "שלושים-ושתיים", "שלושים-ושלוש", "שלושים-וארבע", "שלושים-וחמש", "שלושים-ושש", "שלושים-ושבע", "שלושים-ושמונה", "שלושים-ותשע", "ארבעים",
"ארבעים-ואחת", "ארבעים-ושתיים", "ארבעים-ושלוש", "ארבעים-וארבע", "ארבעים-וחמש", "ארבעים-ושש", "ארבעים-ושבע", "ארבעים-ושמונה", "ארבעים-ותשע", "חמישים",
"חמישים-ואחת", "חמישים-ושתיים", "חמישים-ושלוש", "חמישים-וארבע", "חמישים-וחמש", "חמישים-ושש", "חמישים-ושבע", "חמישים-ושמונה", "חמישים-ותשע", "שישים",
"שישים-ואחת", "שישים-ושתיים", "שישים-ושלוש", "שישים-וארבע", "שישים-וחמש", "שישים-ושש", "שישים-ושבע", "שישים-ושמונה", "שישים-ותשע", "שבעים",
"שבעים-ואחת", "שבעים-ושתיים", "שבעים-ושלוש", "שבעים-וארבע", "שבעים-וחמש", "שבעים-ושש", "שבעים-ושבע", "שבעים-ושמונה", "שבעים-ותשע", "שמונים",
"שמונים-ואחת", "שמונים-ושתיים", "שמונים-ושלוש", "שמונים-וארבע", "שמונים-וחמש", "שמונים-ושש", "שמונים-ושבע", "שמונים-ושמונה", "שמונים-ותשע", "תשעים",
"תשעים-ואחת", "תשעים-ושתיים", "תשעים-ושלוש", "תשעים-וארבע", "תשעים-וחמש", "תשעים-ושש", "תשעים-ושבע", "תשעים-ושמונה", "תשעים-ותשע", "מאה"]
extended_numbers = [
# 100 to 120
"מאה", "מאה-ואחת", "מאה-ושתיים", "מאה-ושלוש", "מאה-וארבע", "מאה-וחמש", "מאה-ושש", "מאה-ושבע",
"מאה-ושמונה", "מאה-ותשע", "מאה-ועשר", "מאה-ואחת-עשרה", "מאה-ושתים-עשרה", "מאה-ושלוש-עשרה",
"מאה-וארבע-עשרה", "מאה-וחמש-עשרה", "מאה-ושש-עשרה", "מאה-ושבע-עשרה", "מאה-ושמונה-עשרה",
"מאה-ותשע-עשרה", "מאה-ועשרים",

# Additional numbers
"מאה-ועשרים-ואחת", "מאה-ועשרים-ושתיים", "מאה-ועשרים-ושלוש", "מאה-ועשרים-וארבע", 
"מאה-ועשרים-וחמש", "מאה-ועשרים-ושש", "מאה-ועשרים-ושבע", "מאה-ועשרים-ושמונה",
"מאה-ועשרים-ותשע", "מאה-ושלושים", "מאה-ושלושים-ושתיים", "מאה-וארבעים", "מאה-וארבעים-ושלוש",
"מאה-וחמישים", "מאה-וחמישים-וארבע", "מאה-ושישים", "מאה-ושישים-וחמש", "מאה-ושבעים",
"מאה-ושבעים-ושש", "מאה-ושמונים", "מאה-ושמונים-ושבע", "מאה-ותשעים", "מאה-ותשעים-ושמונה",
"מאה-ותשעים-ותשע", "מאתיים",

# 200 to 220
"מאתיים", "מאתיים-ואחת", "מאתיים-ושתיים", "מאתיים-ושלוש", "מאתיים-וארבע", "מאתיים-וחמש",
"מאתיים-ושש", "מאתיים-ושבע", "מאתיים-ושמונה", "מאתיים-ותשע", "מאתיים-ועשר", 
"מאתיים-ואחת-עשרה", "מאתיים-ושתים-עשרה", "מאתיים-ושלוש-עשרה", "מאתיים-וארבע-עשרה", 
"מאתיים-וחמש-עשרה", "מאתיים-ושש-עשרה", "מאתיים-ושבע-עשרה", "מאתיים-ושמונה-עשרה", 
"מאתיים-ותשע-עשרה", "מאתיים-ועשרים",

# Additional numbers
"מאתיים-ועשרים-ותשע", "מאתיים-ושלושים", "מאתיים-ושלושים-ושמונה", "מאתיים-וארבעים",
"מאתיים-וארבעים-ושבע", "מאתיים-וחמישים", "מאתיים-וחמישים-ושש", "מאתיים-ושישים",
"מאתיים-ושישים-וחמש", "מאתיים-ושבעים", "מאתיים-ושבעים-וארבע", "מאתיים-ושמונים",
"מאתיים-ושמונים-ושלוש", "מאתיים-ותשעים", "שלוש-מאות",

# 300 to 320
"שלוש-מאות", "שלוש-מאות-ואחת", "שלוש-מאות-ושתיים", "שלוש-מאות-ושלוש", "שלוש-מאות-וארבע", 
"שלוש-מאות-וחמש", "שלוש-מאות-ושש", "שלוש-מאות-ושבע", "שלוש-מאות-ושמונה", "שלוש-מאות-ותשע", 
"שלוש-מאות-ועשר", "שלוש-מאות-ואחת-עשרה", "שלוש-מאות-ושתים-עשרה", "שלוש-מאות-ושלוש-עשרה",
"שלוש-מאות-וארבע-עשרה", "שלוש-מאות-וחמש-עשרה", "שלוש-מאות-ושש-עשרה", 
"שלוש-מאות-ושבע-עשרה", "שלוש-מאות-ושמונה-עשרה", "שלוש-מאות-ותשע-עשרה", "שלוש-מאות-ועשרים"]

extended_numbers_new = [
# 1000 to 1029
"אלף", "אלף-ואחת", "אלף-ושתיים", "אלף-ושלוש", "אלף-וארבע", "אלף-וחמש", "אלף-ושש", 
"אלף-ושבע", "אלף-ושמונה", "אלף-ותשע", "אלף-ועשר", "אלף-ואחת-עשרה", "אלף-ושתים-עשרה", 
"אלף-ושלוש-עשרה", "אלף-וארבע-עשרה", "אלף-וחמש-עשרה", "אלף-ושש-עשרה", "אלף-ושבע-עשרה", 
"אלף-ושמונה-עשרה", "אלף-ותשע-עשרה", "אלף-ועשרים", "אלף-ועשרים-ואחת", "אלף-ועשרים-ושתיים", 
"אלף-ועשרים-ושלוש", "אלף-ועשרים-וארבע", "אלף-ועשרים-וחמש", "אלף-ועשרים-ושש", 
"אלף-ועשרים-ושבע", "אלף-ועשרים-ושמונה", "אלף-ועשרים-ותשע",

# 1500 to 1529
"אלף-וחמש-מאות", "אלף-וחמש-מאות-ואחת", "אלף-וחמש-מאות-ושתיים", "אלף-וחמש-מאות-ושלוש", 
"אלף-וחמש-מאות-וארבע", "אלף-וחמש-מאות-וחמש", "אלף-וחמש-מאות-ושש", "אלף-וחמש-מאות-ושבע", 
"אלף-וחמש-מאות-ושמונה", "אלף-וחמש-מאות-ותשע", "אלף-וחמש-מאות-ועשר", "אלף-וחמש-מאות-ואחת-עשרה", 
"אלף-וחמש-מאות-ושתים-עשרה", "אלף-וחמש-מאות-ושלוש-עשרה", "אלף-וחמש-מאות-וארבע-עשרה", 
"אלף-וחמש-מאות-וחמש-עשרה", "אלף-וחמש-מאות-ושש-עשרה", "אלף-וחמש-מאות-ושבע-עשרה", 
"אלף-וחמש-מאות-ושמונה-עשרה", "אלף-וחמש-מאות-ותשע-עשרה", "אלף-וחמש-מאות-ועשרים", 
"אלף-וחמש-מאות-ועשרים-ואחת", "אלף-וחמש-מאות-ועשרים-ושתיים", "אלף-וחמש-מאות-ועשרים-ושלוש", 
"אלף-וחמש-מאות-ועשרים-וארבע", "אלף-וחמש-מאות-ועשרים-וחמש", "אלף-וחמש-מאות-ועשרים-ושש", 
"אלף-וחמש-מאות-ועשרים-ושבע", "אלף-וחמש-מאות-ועשרים-ושמונה", "אלף-וחמש-מאות-ועשרים-ותשע"]


#votes that excluded from the sentences - to check that later 
'''
23_ptv_598323.docx
16_ptv_581836.docx
17_ptv_135103.docx
15_ptv_496915.docx
17_ptv_134006.docx
בעד התקנות – רוב
נגד – אין
16_ptm_128968.docx
בעד הצעת סיעת שינוי להביע אי-אמון בממשלה - 26
נגד - 32
בעד ההצעה להביע אי-אמון בממשלה - 24
נגד - 30
בעד הצעת סיעת ש"ס להביע אי-אמון בממשלה – 28
נגד – 30
בעד הצעת סיעת רע"ם להביע אי-אמון בממשלה – 5
נגד – 50
בעד סעיפים 1-15 - 10
נגד – אין
בעד החוק – 11
 נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 20 
נגד – אין 
בעד ההצעה להעביר את הצעת החוק לוועדה – 12
נגד - אין
17_ptv_133151.docx
20_ptm_341723.docx
20_ptv_387379.docx
16_ptv_386833.docx
בעד: רוב
נגד: אין
18_ptv_165095..docx
25_ptv_1219728.docx
16_ptv_491962.docx
16_ptv_499021.docx
13_ptm_532066.docx
בעד – 3
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 15
נגד – 3
בעד ההצעה להעביר את הצעת החוק לוועדה – 17
נגד – 4
בעד ההצעה לכלול את הנושא בסדר-היום – 10
נגד – אין
18_ptv_139592.docx
15_ptv_495206.docx
16_ptv_577758.docx
23_ptv_578475.docx
17_ptv_132014.docx
19_ptv_266962.docx
בעד –  רוב 
נגד – מיעוט
בעד – רוב 
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
בעד –  רוב
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
בעד –  רוב
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
בעד –  רוב
נגד – מיעוט
בעד –  רוב 
נגד – 2
בעד –  רוב 
נגד – מיעוט
בעד –  רוב 
נגד – מיעוט
16_ptm_533215.docx
בעד שם החוק – 16
נגד – 1
בעד ההסתייגות – 4
נגד – 11
בעד סעיף 1, כהצעת הוועדה – 17
נגד – 3
בעד סעיף 2 – 15
נגד – 2
בעד החוק – 17
נגד – 3
14_ptm_532484.docx
בעד הצעות סיעות העבודה ומרצ–חד"ש-בל"ד להביע אי-אמון לראש הממשלה – 40
נגד – 43
בעד הצעת ועדת הכנסת – 42
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 11
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 5
נגד – אין
15_ptv_498215.docx
13_ptm_532240.docx
בעד ההחלטה – 12
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 9
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 8
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 18
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 29
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 29
נגד – אין
בעד ההצעה לכלול את הנושא בסדר-היום – 20
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 12
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 15
נגד – אין
בעד ההצעה לכלול את הנושא בסדר-היום – 10
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 5
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 5
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 5
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 4
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 2
נגד – אין
15_ptv_496944.docx
17_ptm_533398.docx
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 25
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 19
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 16
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 17
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 17
נגד - 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 19
נגד – אין 
בעד הודעת הממשלה – 18
נגד – 5
בעד הודעת הוועדה – 21
נגד – 3
בעד ההחלטה – 28
נגד – אין
בעד הודעת הממשלה על רצונה להחיל דין רציפות על הצעת החוק – 31
נגד – 1
בעד ההסתייגות - 4
נגד - 27
בעד סעיפים 2-1, כהצעת הוועדה - 31
נגד - 3
בעד החוק - 28
נגד - 3
בעד סעיפים 8-1 - 18
נגד - אין
בעד החוק - 18
נגד - אין
בעד סעיפים 5-1 – 16
נגד – אין
בעד החוק – 16
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 15
 נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 12
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה - 14
נגד - אין
בעד ההצעה לכלול את הנושא בסדר-היום – 11 
נגד – אין
15_ptv_495295.docx
18_ptv_139917.docx
16_ptm_128954.docx
בעד ההצעה להעביר את הצעת החוק לוועדה - 20
נגד - אין
בעד  סעיף 1 - 10
נגד - 1
בעד סעיף 2 - 17
נגד - אין
בעד הצעת החוק - 8
נגד - 12
בעד ההצעה להעביר את הצעת החוק לוועדה – 13
נגד – 1
בעד ההצעה להעביר את הצעת החוק לוועדה - 9
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה - 10
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה - 12
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 11 
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה - 11
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה - 10
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה - 7
נגד - אין
20_ptv_320584.docx
בעד – 7
נגד – 7
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 7
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 9
בעד – 8
נגד – 8
בעד – 7
נגד – 8
בעד – 6
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 6
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 7
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
בעד – 7
נגד – 8
15_ptv_490845.docx
20_ptv_494974.docx
17_ptv_133454.docx
15_ptv_490916.docx
20_ptm_394541.docx
23_ptv_600338.docx
16_ptv_548123.docx
15_ptv_494780.docx
18_ptv_138917.docx
25_ptv_1457545.docx
23_ptv_598723.docx
19_ptv_262672.docx
17_ptm_129748.docx
בעד הצעת סיעות הליכוד - יהדות התורה להביע אי-אמון בממשלה –  43
נגד – 57 
בעד הצעת סיעת מרצ להביע אי-אמון בממשלה – 42
נגד – 57
בעד הצעת סיעת ישראל ביתנו להביע אי-אמון בממשלה – מיעוט
נגד - רוב 
בעד הצעת סיעת האיחוד הלאומי - מפד"ל להביע אי-אמון בממשלה – מיעוט
נגד - רוב
בעד הצעת סיעות רע"ם-תע"ל--חד"ש--בל"ד להביע אי-אמון בממשלה – מיעוט
נגד - רוב
16_ptv_386822.docx
16_ptv_489839.docx
20_ptv_370910.docx
16_ptv_499045.docx
16_ptv_71595.docx
18_ptv_139299.docx
20_ptv_519812.docx
20_ptv_488037.docx
בעד – 5
נגד – 8
בעד – הרוב
נגד – אין
17_ptv_133749.docx
17_ptv_137100.docx
13_ptm_532389.docx
בעד הערעורים על החלטת ועדת הכספים בדבר אישור הוראות בצו – 2
נגד – 6
בעד שם החוק, כהצעת הוועדה – רוב
נגד – מיעוט
הצבעה בעד התיקון של חברי הכנסת א' כ"ץ-עוז וח' אורון לסעיף 1 – מיעוט
נגד – רוב
בעד סעיף 1, כהצעת הוועדה – רוב
נגד – מיעוט
בעד סעיף 2, כהצעת הוועדה – רוב
נגד – מיעוט
בעד התיקון של חברי הכנסת מ' איתן, ר' נחמן, ס' שלום וד' תיכון לסעיף 3 – מיעוט
נגד – רוב התיקון של חברי הכנסת מ' איתן, ר' נחמן, ס' שלום וד' תיכון לסעיף 3 לא נתקבל.
בעד התיקון לחלופין (1) לסעיף 3 – מיעוט
נגד – רוב התיקון לחלופין (1) של חברי הכנסת מ' איתן, ר' נחמן, ס' שלום וד' תיכון לסעיף 3
בעד התיקון לחלופין (2) לסעיף 3 – מיעוט
נגד – רוב התיקון לחלופין (2) של חברי הכנסת מ' איתן, ר' נחמן, ס' שלום וד' תיכון לסעיף 3
בעד ההצעה של חברי הכנסת א' כ"ץ-עוז וח' אורון לסעיף 3 – מיעוט
נגד – רוב ההצעה של חברי הכנסת א' כ"ץ-עוז וח' אורון לסעיף 3 לא נתקבלה.
בעד סעיף 3, כהצעת הוועדה – רוב
נגד – מיעוט
בעד ההצעה של חברי הכנסת א' כ"ץ-עוז וח' אורון אחרי סעיף 3 – מיעוט
נגד – רוב ההצעה של חברי הכנסת א' כ"ץ-עוז וח' אורון אחרי סעיף 3 לא נתקבלה.
בעד החוק – 8
נגד – אין
בעד החוק – 6
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 7
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 11
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 5
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 5
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 4
נגד – אין
19_ptv_279660.docx
בעד אישור סעיף 53 – פה אחד 
נגד – אין 
בעד אישור סעיף 53א. – פה אחד
נגד – אין 
בעד אישור סעיף 53ב. – פה אחד
נגד – אין 
בעד אישור סעיף 53ג. – פה אחד
נגד – אין 
בעד אישור סעיף 53ד. – פה אחד
נגד – אין 
בעד אישור סעיף 53ה. – פה אחד 
נגד – אין
בעד אישור סעיף 54 – פה אחד 
נגד – אין 
20_ptv_311936.docx
16_ptm_129202.docx
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה -  59
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 58
נגד - אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 47
נגד - 7
בעד הצעת ועדת הכנסת – 10
נגד – אין
בעד הודעת יושב-ראש ועדת הכנסת – 15
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 20
נגד - אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 16
נגד - 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 19
נגד - אין
בעד ההצעה להעביר את הנושא לוועדה – 15
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה -  9
נגד -  3
בעד ההצעה לכלול את הנושא בסדר-היום - 6
נגד - 1
בעד ההצעה לכלול את הנושא בסדר-היום - 7
נגד - אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 7
נגד – אין
בעד ההצעה לכלול את הנושא בסדר-היום – 6
נגד – אין
13_ptm_532058.docx
בעד ההצעה לכלול את הנושא בסדר-היום – 36
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 22
נגד – אין
בעד התיקון של חבר הכנסת ד' תיכון לשם החוק –
נגד –
בעד התיקון של חבר הכנסת ד' תיכון לשם החוק – 2
נגד – 9
בעד שם החוק, כהצעת הוועדה – 7
נגד – 2
בעד התיקון של חברת הכנסת ת' גוז'נסקי לסעיף 1 – 2
נגד – 8
בעד סעיף 1, כהצעת הוועדה – 7
נגד – 1
בעד התיקון של חברת הכנסת ת' גוז'נסקי לסעיף 2 – 3
נגד – 8
בעד סעיף 2, כהצעת הוועדה – 7
נגד – 1
בעד סעיפים 4-3 – 7
נגד – 1
בעד ההצעה של חבר הכנסת ד' תיכון אחרי סעיף 4 – 2
נגד – 7
בעד התיקון של חבר הכנסת ד' תיכון לסעיף 5 – 2
נגד – 8
בעד סעיף 5, כהצעת הוועדה ולרבות גיליון התיקון – 7
נגד – 1
בעד ההצעה של חבר הכנסת ד' תיכון לסעיף 6 – 2
נגד – 8
בעד התיקון של חברת הכנסת ת' גוז'נסקי לסעיף 6 – 1
נגד – 8
בעד סעיף 6, כהצעת הוועדה – 7
נגד – 1
בעד החוק – 8
נגד – 2
17_ptv_135556.docx
16_ptm_129080.docx
בעד הצעת סיעת ש"ס להביע אי-אמון בממשלה – 34
נגד – 48
בעד הצעת סיעת האיחוד הלאומי – ישראל ביתנו להביע אי-אמון בממשלה –  29
נגד –  48
בעד הצעת הסיכום שהביא חבר הכנסת עבד-אלמאלכ דהאמשה – 12 
נגד – 50 
בעד הצעת הסיכום שהביא חבר הכנסת ג'מאל זחאלקה –  9 
נגד – 51
בעד הצעת הסיכום שהביא חבר הכנסת מוחמד ברכה – 8
נגד – 52
בעד הצעת הסיכום שהביא חבר הכנסת חיים אורון – 22
נגד – 54
בעד הצעת הסיכום שהביא חבר הכנסת אריה אלדד – 12
נגד – 67
בעד הצעת הסיכום שהביא חבר הכנסת גדעון סער – 73
נגד – 7
בעד סעיפים 1-3 - 36
נגד – 2
בעד החוק – 36
נגד – 2
18_ptv_166075..docx
19_ptv_232326.docx
בעד ההצעה להעביר את הצעת החוק לדיון בוועדת המדע והטכנולוגיה – פה אחד
נגד – אין
בעד אישור המלצת הוועדה הציבורית – רוב
נגד – אין
בעד אישור סעיף 3 בסדר היום – פה אחד
נגד – אין
14_ptm_532608.docx
בעד סעיף 1 – רוב
נגד – אין
בעד החוק – 19
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 8
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון בוועדה – 10
נגד – 2
בעד הצעת הסיכום שהביא חבר הכנסת ב' אלון – 5
נגד – 32
בעד הצעת הסיכום שהביא חבר הכנסת ע' דהאמשה – 7
נגד – 32
בעד הצעת הסיכום שהביאה חברת הכנסת ת' גוז'נסקי – 10
נגד – 30
בעד הצעת הסיכום שהביא חבר הכנסת ח' אורון – 17
נגד – 32
בעד הצעת הסיכום שהביא חבר הכנסת ח' רמון – 17
נגד – 31
בעד הצעת הסיכום שהביא חבר הכנסת י' כהן – 29
נגד – 22
בעד הצעת הסיכום שהביא חבר הכנסת ט' אלסאנע – 12
נגד – 31
בעד הצעת הסיכום שהביא חבר הכנסת ה' מחאמיד – 18
נגד – 30
בעד הצעת הסיכום שהביא חבר הכנסת ו' צאדק חאג'-יחיא – 19
נגד – 32
בעד הצעת הסיכום שהביא חבר הכנסת י' ביילין – 18
נגד – 34
בעד הצעת הסיכום שהביא חבר הכנסת מ' איתן – 30
נגד – 23
בעד ההצעה לכלול את הנושאים בסדר-היום של הכנסת – 12
נגד – אין
20_ptm_313902.docx
בעד הצעת ועדת הכנסת – 45 
נגד – 34
16_ptv_548530.docx
17_ptm_533401.docx
16_ptm_533607.docx
בעד סעיף 1 – 18
נגד – אין 
בעד החוק – 19
נגד – אין
בעד הצעת הסיכום שהביא חבר הכנסת עבד-אלמאלכ דהאמשה – 4
נגד – 16
בעד הצעת הסיכום שהביא חבר הכנסת עסאם מח'ול – 4
נגד – 17
בעד הצעת הסיכום שהביא חבר הכנסת נסים זאב – 14
נגד – 12
בעד הצעת הסיכום שהביא חבר הכנסת אברהם בורג – 12
נגד – 10
בעד הצעת הסיכום שהביאה חברת הכנסת רוחמה אברהם – 19
נגד – 10
16_ptv_549100.docx
20_ptv_341020.docx
15_ptm_533086.docx
בעד הצעת ההחלטה – 7
נגד – אין
בעד הצעת ההחלטה – 5
נגד – אין
בעד ההסתייגות – 15
נגד – 37
בעד ההסתייגות – 15
נגד – 39
בעד ההסתייגות – 18
נגד – 37
בעד שם החוק, כהצעת הוועדה – 53
נגד – 20
בעד ההסתייגות – 18
נגד – 43
בעד סעיף 1, כהצעת הוועדה – 42
נגד – 12
בעד סעיף 2, כהצעת הוועדה – 47
נגד – 15
בעד סעיף 3, כהצעת הוועדה – 23
נגד – 5
בעד סעיף 4, כהצעת הוועדה – 30
נגד – 10
בעד סעיף 5, כהצעת הוועדה – 23
נגד – 6
בעד ההסתייגות – 16
נגד – 50
בעד ההסתייגות – 17
נגד – 51
בעד סעיף 6, כהצעת הוועדה – 54
נגד – 16
בעד סעיף 7, כהצעת הוועדה – 51
נגד – 17
בעד סעיף 8, כהצעת הוועדה – 53
נגד – 18
בעד סעיף 9, כהצעת הוועדה – 53
נגד – 20
בעד סעיף 10, כהצעת הוועדה – 53
נגד – 20
בעד סעיף 11 – 53
נגד – 19
בעד ההסתייגות – 15
נגד – 53
בעד ההסתייגות – 22
נגד – 51
בעד ההסתייגות – 20
נגד – 60
בעד ההסתייגות – 20
נגד – 57
בעד ההסתייגות – 22
נגד – 61
בעד ההסתייגות – 22
נגד – 58
בעד ההסתייגות – 23
נגד – 28
בעד ההסתייגות – 14
נגד – 36
בעד ההסתייגות – 9
נגד – 46
בעד ההסתייגות – 12
נגד – 37
בעד ההסתייגות – 12
נגד – 41
בעד ההסתייגות – 24
נגד – 30
בעד ההסתייגות – 15
נגד – 48
בעד ההסתייגות – 14
נגד – 47
בעד ההסתייגות – 14
נגד – 47
בעד סעיף 57 – רוב
נגד – אין
בעד החוק – 48
נגד – 18
בעד שם החוק – 35
נגד – 10
בעד סעיף 1 – 50
נגד – 4
בעד סעיף 2 – 49
נגד – 6
בעד החוק – 57
נגד – 4
בעד ההסתייגות – 36
נגד – 23
בעד ההסתייגות – 22
נגד – 33
בעד ההסתייגות – 17
נגד – 41
בעד ההסתייגות – 38
נגד – 28
בעד סעיף 1 – 41
נגד – 30
בעד ההסתייגות – 21
נגד – 48
בעד ההסתייגות – 42
נגד – 28
בעד ההסתייגות – 43
נגד – 31
בעד ההצעה להחזיר את הצעת החוק לוועדה – 26
נגד – 39
בעד סעיף 2, כהצעת הוועדה ועם ההסתייגות שנתקבלה – 42
נגד – 29
בעד סעיף 3 – 43
נגד – 26
בעד החוק – 27
נגד – 44
בעד ההסתייגות – 15
נגד – 39
בעד ההסתייגות – 14
נגד – 42
בעד ההסתייגות – 15
נגד – 48
בעד סעיף 1 – 41
נגד – 27
בעד ההסתייגות – 20
נגד – 47
בעד ההסתייגות – 20
נגד – 46
בעד סעיף 2, כהצעת הוועדה – 59
נגד – 8
בעד ההסתייגות – 32
נגד – 30
בעד החוק – 53
נגד – 8
בעד סעיפים 3-1 – 52
נגד – 7
בעד ההסתייגות – 11
נגד – 58
בעד סעיפים 6-4, כהצעת הוועדה – 55
נגד – 8
בעד ההסתייגות – 13
נגד – 55
בעד החוק – 63
נגד – 8
בעד ההסתייגות – 14
נגד – 48
בעד ההסתייגות – 51
נגד – 18
בעד סעיף 1 – 50
נגד – 16
בעד החוק – 49
נגד – 15
בעד סעיף 01 – 43
נגד – 14
בעד ההסתייגות – 15
נגד – 37
בעד ההסתייגות – 16
נגד – 39
בעד ההסתייגות – 14
נגד – 40
בעד ההסתייגות – 15
נגד – 42
בעד ההסתייגות – 1
נגד – 38
בעד סעיף 20, כהצעת הוועדה – 43
נגד – 11
בעד ההסתייגות – 9
נגד – 44
בעד ההסתייגות – 10
נגד – 43
בעד ההסתייגות – 10
נגד – 41
בעד ההסתייגות – 5
נגד – 44
בעד ההסתייגות – 12
נגד – 38
בעד ההסתייגות – 11
נגד – 41
בעד ההסתייגות – 11
נגד – 40
בעד ההסתייגות – 15
נגד – 40
בעד ההסתייגות – 12
נגד – 38
בעד ההסתייגות – 14
נגד – 38
בעד ההסתייגות – 13
נגד – 37
בעד ההסתייגות – 15
נגד – 36
בעד ההסתייגות – 14
נגד – 37
בעד ההסתייגות – 16
נגד – 40
בעד ההסתייגות – 14
נגד – 41
בעד ההסתייגות – 13
נגד – 41
בעד ההסתייגות – 12
נגד – 43
בעד ההסתייגות – 12
נגד – 44
בעד ההסתייגות – 12
נגד – 47
בעד ההסתייגות – 16
נגד – 44
בעד ההסתייגות – 9
נגד – 42
בעד ההסתייגות – 15
נגד – 43
בעד ההסתייגות – 11
נגד – 48
בעד ההסתייגות – 13
נגד – 50
בעד ההסתייגות – 13
נגד – 50
בעד ההסתייגות – 13
נגד – 49
בעד ההצעה – 52
נגד – 16
בעד החוק – 53
נגד – 19
16_ptv_577443.docx
18_ptv_139021.docx
15_ptm_532855.docx
בעד שם החוק – 47
נגד – 14
בעד ההסתייגות הראשונה של קבוצת חבר הכנסת י' פריצקי לסעיף 1 – 16
נגד – 42
בעד ההסתייגות לחלופין של קבוצת חבר הכנסת י' פריצקי לסעיף 1 – 16
נגד – 44
בעד ההסתייגות של קבוצת חבר הכנסת א' פינס-פז לסעיף 1 – 19
נגד – 44
בעד ההסתייגות של קבוצת חבר הכנסת י' פריצקי לסעיף 1 – 17
נגד – 47
בעד ההסתייגות לחלופין של קבוצת חבר הכנסת י' פריצקי לסעיף 1 – 18
נגד – 47
בעד ההסתייגות של קבוצת חבר הכנסת א' פינס-פז לסעיף 1 – 31
נגד – 36
בעד ההסתייגות של קבוצת חבר הכנסת א' פינס-פז לסעיף 1 – 23
נגד – 48
בעד סעיף 1, כהצעת הוועדה – 51
נגד – 21
בעד ההסתייגות של חברי הכנסת צ' הנדל, י' דיין ור' ריבלין אחרי סעיף 1 – 46
נגד – 18
בעד ההסתייגות של קבוצת חבר הכנסת י' פריצקי לסעיף 2 – 19
נגד – 45
בעד סעיף 2, כהצעת הוועדה – 49
נגד – 25
בעד ההסתייגות של קבוצת חבר הכנסת י' פריצקי לסעיף 3 – 19
נגד – 46
בעד ההסתייגות לחלופין של קבוצת חבר הכנסת י' פריצקי לסעיף 3 – 19
נגד – 49
בעד ההסתייגות של חברי הכנסת נ' זאב וי' ליצמן לסעיף 3 – 50
נגד – 20
בעד ההסתייגות של קבוצת חבר הכנסת א' פינס-פז לסעיף 3(ג) – 20
נגד – 49
בעד ההסתייגות של חבר הכנסת י' ליצמן לסעיף 3(ג) – 32
נגד – 33
בעד סעיף 3, כהצעת הוועדה ועם ההסתייגויות שנתקבלו – 51
נגד – 21
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 38
נגד – 40
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 47
נגד – 37
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 70
נגד – 4
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 50
נגד – 36
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 47
נגד – 35
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 45
נגד – 38
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 49
נגד – 32
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 61
נגד – 14
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 40
נגד – 48
בעד סעיפים 6-1 – 54
נגד – אין
בעד ההסתייגות של חבר הכנסת ס' שלום לסעיף 7 – 17
נגד – 33
בעד ההסתייגות של חבר הכנסת מ' גפני לסעיף 7 – 41
נגד – 26
בעד סעיף 7 – 37
נגד – 21
בעד סעיף 8 – 56
נגד – 3
בעד סעיף 9 – 53
נגד – 6
בעד ההסתייגות של חבר הכנסת ס' שלום אחרי סעיף 9 – 21
נגד – 28
בעד סעיף 10 – 54
נגד – אין
בעד סעיף 11 – 51
נגד – 1
בעד סעיפים 20-12, לרבות התיקון הטכני לסעיף 19 – 50
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 31
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 45
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 55
נגד – 1
בעד ההצעה להעביר את הצעת החוק לוועדה – 33
נגד – 37
בעד סעיפים 3-2 – 53
נגד – אין
בעד החוק – 43
נגד – אין
בעד ההצעה – 18
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 34
נגד – 6
בעד סעיף 1 – 34
נגד – אין
בעד סעיף 2 – 35
נגד – אין
בעד סעיפים 8-3 – 40
נגד – 1
בעד החוק – 35
נגד – 1
בעד סעיף 1 – 33
נגד – 1
בעד החוק – 35
נגד – 1
בעד ההצעה להעביר את הצעת החוק לוועדה – 55
נגד – אין
בעד שם החוק – 55
נגד – אין
בעד סעיפים 3-1 – 56
נגד – אין
בעד סעיפים 23-5 – 58
נגד – אין
בעד ההסתייגות של חבר הכנסת א' זנדברג לסעיף 24 – 28
נגד – 27
בעד סעיף 24, כהצעת הוועדה ועם ההסתייגות שנתקבלה – 54
נגד – 1
בעד סעיפים 29-25 – 49
נגד – אין
בעד ההסתייגות של חבר הכנסת א' רביץ לסעיף 30 – 39
נגד – 20
בעד סעיף 30, כהצעת הוועדה ועם ההסתייגות שנתקבלה – 60
נגד – אין
בעד סעיפים 39-31 – 60
נגד – אין
בעד החוק – 59
נגד – אין
בעד סעיפים 12-1 – 38
נגד – אין
בעד החוק – 39
נגד – אין
בעד ההסתייגות של חברי הכנסת י' גאגולה וי' וקנין לסעיף 1 – 20
נגד – 32
בעד ההסתייגות לחלופין של חברי הכנסת י' גאגולה וי' וקנין לסעיף 1 – 20
נגד – 32
בעד סעיף 1, כהצעת הוועדה – 50
נגד – אין
בעד סעיפים 3-2 – 50
נגד – אין
בעד סעיף 4 – 50
נגד – אין
בעד סעיפים 18-5, לרבות התיקון בסעיף 15 – 50
נגד – אין
בעד החוק – 49
נגד – אין
בעד סעיפים 4-1 – 24
נגד – אין
בעד החוק – 31
נגד – אין
בעד סעיף 1 – 23
נגד – אין
בעד החוק – 20
נגד – אין
בעד סעיף 1 – 24
נגד – אין
בעד החוק – 21
נגד – אין
בעד סעיף 1 – 18
נגד – אין
בעד החוק – 21
נגד – אין
בעד סעיפים 3-1 – 21
נגד – אין
בעד החוק – 16
נגד – אין
בעד סעיפים 5-1 – 19
נגד – אין
בעד החוק – 24
נגד – אין
בעד סעיפים 2-1 – 23
נגד – אין
בעד החוק – 26
נגד – אין
בעד סעיף 1 – 24
נגד – אין
בעד החוק – 19
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 26
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 28
נגד – 3
בעד ההצעה להעביר את הצעת החוק לוועדה – 34
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 34
נגד – אין
בעד סעיפים 5-1 – 29
נגד – אין
בעד החוק – 31
נגד – אין
בעד סעיף 1 – 29
נגד – אין
בעד החוק – 28
נגד – אין
בעד סעיפים 5-1 – 25
נגד – אין
בעד החוק – 30
נגד – אין
בעד סעיפים 10-1 – 36
נגד – 1
בעד ההסתייגות של חבר הכנסת ע' מח'ול לסעיף 11 – 1
נגד – 34
בעד סעיפים 15-11, כהצעת הוועדה – 34
נגד – אין
בעד החוק – 35
נגד – אין
17_ptv_134507.docx
20_ptv_397418.docx
14_ptm_532731.docx
בעד ההצעה להעביר את הצעת חוק לדיון מוקדם בוועדה – 17
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 14
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 23
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 13
נגד – 11
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 19
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 27
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 30
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 25
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 9
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 12
נגד – אין
בעד ההצעה לכלול את הנושא בסדר-היום – 10
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 7
נגד – אין
בעד ההצעה לכלול את הנושא בסדר-היום – 3
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 4
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 2
נגד – 1
19_ptm_304163.docx
בעד הצעת סיעת ש"ס להביע אי-אמון בממשלה – 36
נגד – 57
בעד הצעת סיעות יהדות התורה – מרצ להביע אי-אמון בממשלה – 37
נגד – 57
בעד הצעת סיעות חד"ש–רע"ם-תע"ל-מד"ע–בל"ד להביע אי-אמון בממשלה – 35
נגד – 57 
בעד ההצעה להעביר את הצעת החוק לוועדה – 43
נגד – 20
בעד הודעת הממשלה – 41
נגד – 4
בעד הודעת הממשלה – 40
נגד – 5
בעד סעיפים 1–5 – 43
נגד – 1
בעד החוק – 46
נגד – אין 
בעד סעיף 1 – 34
נגד – אין
בעד החוק – 40
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 35
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 40
נגד – אין
בעד סעיף 1 – 30
נגד – 8
בעד החוק – 26
נגד – 7
בעד ההצעה להעביר את הצעת החוק לוועדה – 32
נגד – 4
בעד סעיפים 1–2 – 29
נגד – אין
בעד החוק – 30
נגד – אין
בעד סעיפים 1–6 – 25
נגד – אין
בעד החוק – 24
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 28
נגד – אין
18_ptv_139933.docx
16_ptm_129137.docx
בעד סעיפים 1-4 – 21
נגד – 1
בעד החוק – 20
נגד – אין
20_ptv_341230.docx
25_ptv_3841247.docx
16_ptv_493376.docx
20_ptm_487089.docx
בעד ההצעה להעביר את הנושא לוועדה – 17
נגד – אין
בעד ההצעה להעביר את הצעת החוק לוועדה – 11
נגד – אין
19_ptv_302840.docx
15_ptm_532756.docx
בעד סעיפים 16-1 – 4
נגד – 1
בעד החוק – 6
נגד – 1
בעד סעיפים 12-1 – 6
נגד – 1
בעד החוק – 6
נגד – 1
16_ptv_386758.docx
בעד – 4
נגד – 2
בעד – 2
נגד – 5
בעד – 2
נגד – 5
בעד – 2
נגד – 5
בעד – 2
נגד – 5
בעד – 2
נגד – 5
בעד – 5
נגד – 2
בעד – 2
נגד – 6
בעד – 2
נגד – 6
בעד – 6
נגד – 2
בעד – 2
נגד – 6
בעד – 2
נגד – 6
בעד – 6
נגד – 2
19_ptv_253687.docx
17_ptv_136809.docx
23_ptv_582824.docx
17_ptv_132523.docx
18_ptv_165084..docx
17_ptm_533539.docx
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 29
נגד - אין
בעד ההצעה להעביר את הצעת החוק  לדיון מוקדם בוועדה – 45
נגד - אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 47
נגד - אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה - 35
נגד - 2
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 40
נגד - 2
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 47
נגד – 1
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 48
נגד – אין
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 52
נגד - אין 
בעד ההצעה להעביר את הצעת החוק לדיון מוקדם בוועדה – 35
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 9
נגד – 3
בעד ההצעה להעביר את הנושא לוועדה - 6
נגד - אין
בעד ההצעה להעביר את הנושא לוועדה – 6
נגד – אין
בעד ההצעה להעביר את הנושא לוועדה – 5
נגד - אין 
בעד ההצעה להעביר את הצעת החוק לוועדה – 4
נגד – אין
20_ptv_490139.docx
בעד –  2
נגד – אין
בעד –  2
נגד –  אין
15_ptv_494321.docx
בעד  -  7
נגד - 1
בעד – 10
נגד – 1
בעד – 9
נגד – 2
23_ptv_599659.docx
16_ptv_572718.docx
17_ptv_132714.docx
'''
